// تهيئة مكتبة Animate On Scroll (لظهور العناصر عند التمرير)
AOS.init({
    duration: 800, // مدة الحركة بالمللي ثانية
    once: true,    // الحركة تحدث مرة واحدة فقط
});

// تهيئة مكتبة Typed.js (لتأثير الكتابة)
var typed = new Typed('#typed', {
    // تم تحديث النصوص هنا لتعرض خدماتك
    strings: [
    'تطوير المواقع',
    'التسويق الرقمي',
    'إدارة الخوادم',
    'اشتراكات Netflix',
    'مجموعات VIP',
    'دعم حسابات التواصل',
    'تصميم البروفايلات',
    'إنشاء التطبيقات',
    'إنشاء كونفيجات VPS'
],
    typeSpeed: 70,   // سرعة الكتابة
    backSpeed: 50,   // سرعة الحذف
    loop: true       // تكرار الحركة
});